# **Eleman İşlemleri 2**

In [35]:
import numpy as np
import pandas as pd

In [36]:
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)

In [37]:
sozluk = {"var1":s1, "var2":s2,"var3":s3}

In [38]:
sozluk

{'var1': array([1, 9, 9, 2, 3]),
 'var2': array([1, 3, 2, 4, 5]),
 'var3': array([3, 5, 4, 2, 9])}

In [39]:
df = pd.DataFrame(sozluk)

In [40]:
df

   var1  var2  var3
0     1     1     3
1     9     3     5
2     9     2     4
3     2     4     2
4     3     5     9

In [41]:
df[0:1]

   var1  var2  var3
0     1     1     3

In [42]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [43]:
df.index = ["a","b","c","d","e"]

In [44]:
df

   var1  var2  var3
a     1     1     3
b     9     3     5
c     9     2     4
d     2     4     2
e     3     5     9

In [45]:
df["c":"e"]

   var1  var2  var3
c     9     2     4
d     2     4     2
e     3     5     9

### silme

In [46]:
df.drop("a",axis=0)

   var1  var2  var3
b     9     3     5
c     9     2     4
d     2     4     2
e     3     5     9

In [47]:
df

   var1  var2  var3
a     1     1     3
b     9     3     5
c     9     2     4
d     2     4     2
e     3     5     9

In [48]:
df.drop("a",axis=0,inplace=True)

In [49]:
#inplace dataframe üzerinde yapılan işlemin kalıcı olmasını sağlar

In [50]:
df

   var1  var2  var3
b     9     3     5
c     9     2     4
d     2     4     2
e     3     5     9

### fancy

In [51]:
l = ["c","e"]

In [52]:
df.drop(l,axis=0)

   var1  var2  var3
b     9     3     5
d     2     4     2

### degiskenler icin

In [53]:
df

   var1  var2  var3
b     9     3     5
c     9     2     4
d     2     4     2
e     3     5     9

In [54]:
"var1" in df

True

In [55]:
l = ["var1","var4","var2"]

In [56]:
for i in l:
    print(i in df)

True
False
True

In [57]:
df

   var1  var2  var3
b     9     3     5
c     9     2     4
d     2     4     2
e     3     5     9

In [60]:
df["var1"]

b    9
c    9
d    2
e    3
Name: var1, dtype: int32

In [61]:
df["var4"] = df["var1"]/df["var2"]

In [62]:
df

   var1  var2  var3  var4
b     9     3     5   3.0
c     9     2     4   4.5
d     2     4     2   0.5
e     3     5     9   0.6

### degisken silmek

In [63]:
df.drop("var4",axis=1)

   var1  var2  var3
b     9     3     5
c     9     2     4
d     2     4     2
e     3     5     9

In [64]:
df

   var1  var2  var3  var4
b     9     3     5   3.0
c     9     2     4   4.5
d     2     4     2   0.5
e     3     5     9   0.6

In [65]:
df.drop("var4",axis=1,inplace=True)

In [66]:
df

   var1  var2  var3
b     9     3     5
c     9     2     4
d     2     4     2
e     3     5     9

In [67]:
l = ["var1","var2"]

In [68]:
df.drop(l,axis=1)

   var3
b     5
c     4
d     2
e     9